List<String> sortedList = [
  // الرموز قبل الأرقام
  '!', '"', '#', '\$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', '/',
  // الأرقام
  '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
  // الرموز بين الأرقام والحروف الكبيرة
  ':', ';', '<', '=', '>', '?', '@',
  // الحروف الكبيرة
  'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O',
  'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
  // رموز بعد الحروف الكبيرة
  '[', '\\', ']', '^', '_', '`',
  // الحروف الصغيرة
  'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o',
  'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
  // الرموز الأخيرة
  '{', '|', '}', '~',
  // الحروف الأخيرة
  '¡', '¢', '£', '¤', '¥', '¦', '§', '¨',
  '©', 'ª', '«', '¬', '®', '¯', '°', '±',
  '²', '³', '´', 'µ', '¶'
];
